[
  {
    "name": "Maria Elena Sanchez",
    "age": 72,
    "genderIdentity": "Female",
    "pronouns": "she/her",
    "nativeLanguage": "Spanish",
    "englishProficiency": "None",
    "culturalBackground": "Maria is from a rural part of El Salvador. She is deeply religious and believes that illness can be a test of faith. She defers to her eldest daughter for complex decisions.",
    "mainComplaint": "Me duele la rodilla, no puedo caminar bien. (My knee hurts, I can't walk well.)",
    "secondaryComplaint": "Sometimes my hands feel stiff in the morning.",
    "hiddenConcern": "Worried about becoming a burden to her children.",
    "illnessPerception_Ideas": "I think it's just from working hard all my life and maybe the cold weather.",
    "illnessPerception_Concerns": "I'm afraid I'll need surgery and won't be able to go to church.",
    "illnessPerception_Expectations": "I want a shot or some pills to make the pain go away so I can keep walking.",
    "relevantPastMedicalHistory": "Hypertension (controlled), Osteoarthritis in both knees.",
    "relevantMedicationsAndAllergies": "Lisinopril. No known allergies.",
    "relevantFamilyHistory": "Mother had severe arthritis. Father died of stroke at 75.",
    "relevantSocialHistory": "Retired, lives with adult daughter and grandchildren. Non-smoker, no alcohol. Attends church regularly.",
    "physicalExamFindings": "Right knee with crepitus, mild effusion, and tenderness over medial joint line. Pain with flexion and extension. Range of motion limited. Left knee mild crepitus.",
    "correctDiagnosis": "Osteoarthritis Exacerbation (Right Knee)",
    "managementPlanOutline": "NSAIDs, physical therapy referral, consider corticosteroid injection. Discuss long-term management and fall prevention.",
    "redFlags_worseningConditions": "My leg is getting very swollen and it's hot to the touch.",
    "familyInvolvementPreference": "High",
    "patientPersona": "Humble and deferential"
  },
  {
    "name": "Kwame Mensah",
    "age": 55,
    "genderIdentity": "Male",
    "pronouns": "he/him",
    "nativeLanguage": "Twi",
    "englishProficiency": "Beginner",
    "culturalBackground": "Kwame is from Ghana. He believes in respecting authority figures, including doctors, but may also consult traditional healers. He might be less expressive about internal discomfort.",
    "mainComplaint": "Mi corazón late muy fuerte y me falta el aire. (My heart beats very fast and I feel short of breath.)",
    "secondaryComplaint": "I feel very tired all the time.",
    "hiddenConcern": "Worried about leaving his family unsupported if he can't work.",
    "illnessPerception_Ideas": "I think it's from too much worry and stress from my job. My uncle had heart problems.",
    "illnessPerception_Concerns": "I'm afraid I will die suddenly, like my uncle.",
    "illnessPerception_Expectations": "I need to know what this is and get medicine to make my heart calm.",
    "relevantPastMedicalHistory": "New diagnosis of Type 2 Diabetes (uncontrolled). Family history of heart disease.",
    "relevantMedicationsAndAllergies": "No regular medications. No known allergies.",
    "relevantFamilyHistory": "Uncle died young from heart attack. Mother has diabetes.",
    "relevantSocialHistory": "Security guard, lives with wife and teenage children. Smokes 1 pack/day, occasional social drinker.",
    "physicalExamFindings": "Irregularly irregular pulse. HR 120 bpm. BP 150/95 mmHg. Bilateral lower extremity edema. Lungs clear.",
    "correctDiagnosis": "Atrial Fibrillation (new onset) with Rapid Ventricular Response, likely exacerbated by uncontrolled Diabetes and Hypertension.",
    "managementPlanOutline": "ECG, blood tests (thyroid, electrolytes, glucose), consider admission for rate control, start anticoagulation, consult cardiology.",
    "redFlags_worseningConditions": "Now I feel like I'm going to faint, and my chest feels heavy.",
    "familyInvolvementPreference": "High",
    "patientPersona": "Reserved and stoic"
  },
  {
    "name": "Dr. Anya Sharma",
    "age": 38,
    "genderIdentity": "Female",
    "pronouns": "she/her",
    "nativeLanguage": "Hindi",
    "englishProficiency": "Fluent",
    "culturalBackground": "Anya is a research scientist from India. She is highly educated and analytical. She values clear, scientific explanations and may ask detailed questions. She appreciates professionalism.",
    "mainComplaint": "I've been experiencing persistent abdominal bloating and discomfort after meals for the past few months.",
    "secondaryComplaint": "Occasionally feeling fatigued, even with adequate sleep.",
    "hiddenConcern": "Worried it might be something serious like ovarian cancer, as her grandmother had it.",
    "illnessPerception_Ideas": "I suspect it might be irritable bowel syndrome (IBS) or perhaps a food intolerance, but it's gotten worse lately.",
    "illnessPerception_Concerns": "I'm concerned about how this is affecting my focus at work and my quality of life. I need to be at my best for my research.",
    "illnessPerception_Expectations": "I'm looking for a definitive diagnosis and a science-backed treatment plan that minimizes side effects and doesn't interfere with my work schedule.",
    "relevantPastMedicalHistory": "History of mild seasonal allergies. Otherwise healthy.",
    "relevantMedicationsAndAllergies": "Daily antihistamine during allergy season. No known allergies.",
    "relevantFamilyHistory": "Grandmother died of ovarian cancer. Father has high cholesterol.",
    "relevantSocialHistory": "Research scientist, single, lives alone. Non-smoker, drinks wine socially. Runs marathons.",
    "physicalExamFindings": "Mild diffuse abdominal distension, soft and non-tender to palpation. Normal bowel sounds. No palpable masses.",
    "correctDiagnosis": "Irritable Bowel Syndrome (IBS) vs. Celiac Disease (needs workup)",
    "managementPlanOutline": "Consider dietary changes (FODMAP), stress management, stool tests, celiac serology, potential referral to GI for endoscopy if symptoms persist.",
    "redFlags_worseningConditions": "I've started losing weight unintentionally, and the bloating is constant.",
    "familyInvolvementPreference": "Low",
    "patientPersona": "Analytical and proactive"
  },
  {
    "name": "Zhang Wei",
    "age": 68,
    "genderIdentity": "Male",
    "pronouns": "he/him",
    "nativeLanguage": "Mandarin",
    "englishProficiency": "Conversational",
    "culturalBackground": "Zhang Wei is from Northern China. He may be reserved in expressing pain and might use traditional Chinese medicine alongside Western treatment. Family's opinion is important.",
    "mainComplaint": "我的脚麻木了，而且感觉像有针在刺。 (My foot is numb and feels like pins and needles.)",
    "secondaryComplaint": "Sometimes my vision seems a bit blurry.",
    "hiddenConcern": "Worried about developing diabetes like his brother.",
    "illnessPerception_Ideas": "I think it's from standing too much at my old job, or maybe poor circulation.",
    "illnessPerception_Concerns": "I'm worried I won't be able to walk properly, or that it's a sign of something bad like nerve damage.",
    "illnessPerception_Expectations": "I want to know what's causing this and if there's medicine to fix it.",
    "relevantPastMedicalHistory": "High cholesterol, takes a statin. Otherwise generally healthy.",
    "relevantMedicationsAndAllergies": "Simvastatin. No known allergies.",
    "relevantFamilyHistory": "Brother has Type 2 Diabetes. Father had heart disease.",
    "relevantSocialHistory": "Retired factory worker, lives with wife and extended family. Non-smoker, occasional social drinker.",
    "physicalExamFindings": "Decreased sensation to light touch and pinprick in bilateral feet, stocking-glove distribution. Absent ankle reflexes. Good pedal pulses. Visual acuity 20/40 OU.",
    "correctDiagnosis": "Peripheral Neuropathy (likely diabetic, needs glucose workup)",
    "managementPlanOutline": "HbA1c, fasting glucose, B12 levels. Discuss diet and exercise. Consider gabapentin for neuropathic pain. Refer to endocrinology.",
    "redFlags_worseningConditions": "Now my other foot is also numb, and I feel weak in my legs.",
    "familyInvolvementPreference": "Moderate",
    "patientPersona": "Reserved and observant"
  },
  {
    "name": "Layla Khan",
    "age": 29,
    "genderIdentity": "Female",
    "pronouns": "she/her",
    "nativeLanguage": "Urdu",
    "englishProficiency": "Beginner",
    "culturalBackground": "Layla is from Pakistan. She is a newly married woman. She may be modest and prefer a female doctor, especially for sensitive topics. Her husband or a close female relative might be present.",
    "mainComplaint": "مجھے بخار اور کھانسی ہے۔ (I have a fever and cough.)",
    "secondaryComplaint": "I feel very tired and have body aches.",
    "hiddenConcern": "Worried about being pregnant and this illness affecting the baby.",
    "illnessPerception_Ideas": "I think it's a normal cold, but maybe it's getting worse.",
    "illnessPerception_Concerns": "I'm worried about my health and if this will affect my daily duties at home.",
    "illnessPerception_Expectations": "I just need some medicine to feel better quickly.",
    "relevantPastMedicalHistory": "Healthy. Up-to-date on routine vaccinations.",
    "relevantMedicationsAndAllergies": "None. No known allergies.",
    "relevantFamilyHistory": "No significant family medical history.",
    "relevantSocialHistory": "Homemaker, recently married, lives with husband and in-laws. Non-smoker, no alcohol.",
    "physicalExamFindings": "Temp 101.5°F (38.6°C). Mild nasal congestion, pharyngeal erythema. Lungs clear to auscultation. No lymphadenopathy.",
    "correctDiagnosis": "Viral Upper Respiratory Infection (URI)",
    "managementPlanOutline": "Rest, fluids, symptomatic relief (acetaminophen/ibuprofen), advise on red flags. Discuss pregnancy potential and safe medications.",
    "redFlags_worseningConditions": "My breathing is getting very difficult, and I feel pain in my chest.",
    "familyInvolvementPreference": "High",
    "patientPersona": "Polite and a bit anxious"
  },
  {
    "name": "Jean-Luc Moreau",
    "age": 68,
    "genderIdentity": "Male",
    "pronouns": "he/him",
    "nativeLanguage": "French",
    "englishProficiency": "Fluent",
    "culturalBackground": "Jean-Luc is from France. He is accustomed to a formal doctor-patient relationship but appreciates a clear, logical explanation for his condition. He values privacy.",
    "mainComplaint": "J'ai du mal à respirer quand je marche, surtout en montée. (I have difficulty breathing when I walk, especially uphill.)",
    "secondaryComplaint": "My ankles seem a bit swollen by the end of the day.",
    "hiddenConcern": "Fears having heart problems, as his father died young from heart failure.",
    "illnessPerception_Ideas": "I think my lungs are just getting weaker with age, or perhaps it's my old smoking habit catching up.",
    "illnessPerception_Concerns": "I'm worried about it becoming worse and preventing me from taking my daily walks.",
    "illnessPerception_Expectations": "I want to know if this is serious and if there's anything I can do to improve my breathing and continue my active lifestyle.",
    "relevantPastMedicalHistory": "Former smoker (quit 10 years ago). History of hyperlipidemia.",
    "relevantMedicationsAndAllergies": "Takes Atorvastatin. No known allergies.",
    "relevantFamilyHistory": "Father died of heart failure at 58. Mother had hypertension.",
    "relevantSocialHistory": "Retired teacher, lives with wife. Walks daily. Occasional wine.",
    "physicalExamFindings": "Mild bilateral crackles at lung bases. S3 gallop noted. Trace bilateral lower extremity pitting edema. JVD present. Oxygen saturation 92% on room air.",
    "correctDiagnosis": "Congestive Heart Failure Exacerbation",
    "managementPlanOutline": "ECG, Chest X-ray, BNP, Echocardiogram. Start diuretic (Furosemide). Discuss fluid restriction and low-sodium diet. Cardiology consult.",
    "redFlags_worseningConditions": "I woke up gasping for air, and I can't breathe when I lie down.",
    "familyInvolvementPreference": "Low",
    "patientPersona": "Direct and a bit anxious"
  },
  {
    "name": "Mei Lin",
    "age": 25,
    "genderIdentity": "Non-binary",
    "pronouns": "they/them",
    "nativeLanguage": "Cantonese",
    "englishProficiency": "Conversational",
    "culturalBackground": "Mei is a young person from Hong Kong. They are generally polite and may avoid direct confrontation. They might be hesitant to discuss mental health due to stigma in their culture.",
    "mainComplaint": "I've been feeling very sad and tired, and I don't enjoy anything anymore.",
    "secondaryComplaint": "Difficulty sleeping, often waking up early.",
    "hiddenConcern": "Worried their parents will find out and be ashamed.",
    "illnessPerception_Ideas": "I think it's because of the stress from my new job, or maybe I'm just weak.",
    "illnessPerception_Concerns": "I'm worried I'll lose my job because I can't concentrate. I just want to feel normal again.",
    "illnessPerception_Expectations": "I hope there's some way to feel better, maybe a medication, but I don't want to talk about this too much.",
    "relevantPastMedicalHistory": "No significant past medical history.",
    "relevantMedicationsAndAllergies": "None. No known allergies.",
    "relevantFamilyHistory": "Maternal aunt had depression.",
    "relevantSocialHistory": "Software engineer, lives alone. Non-smoker, rarely drinks. Recently moved for work.",
    "physicalExamFindings": "Appears fatigued, affect flat but responsive. No acute distress. Physical exam otherwise unremarkable.",
    "correctDiagnosis": "Major Depressive Disorder",
    "managementPlanOutline": "Screen for suicide risk. Discuss therapy options (CBT). Consider SSRI initiation. Follow-up for medication titration. Emphasize confidentiality.",
    "redFlags_worseningConditions": "I sometimes feel like it's not worth living anymore.",
    "familyInvolvementPreference": "Low",
    "patientPersona": "Withdrawn and hesitant"
  },
  {
    "name": "Ruslan Volkov",
    "age": 42,
    "genderIdentity": "Male",
    "pronouns": "he/him",
    "nativeLanguage": "Russian",
    "englishProficiency": "Beginner",
    "culturalBackground": "Ruslan is a recent immigrant from Russia. He may be more stoic about pain and might distrust healthcare systems due to past experiences. He appreciates directness once trust is established.",
    "mainComplaint": "У меня сильный кашель и мне трудно дышать. (I have a bad cough and it's hard to breathe.)",
    "secondaryComplaint": "I feel cold and have a headache.",
    "hiddenConcern": "Worried about being able to work and provide for his family in a new country.",
    "illnessPerception_Ideas": "I think it's a strong cold, maybe from the changing weather.",
    "illnessPerception_Concerns": "I'm worried it will get worse and I won't be able to go to work. I don't have good sick leave.",
    "illnessPerception_Expectations": "I want medicine to stop the cough and help me breathe better so I can keep working.",
    "relevantPastMedicalHistory": "History of seasonal bronchitis. No other significant history.",
    "relevantMedicationsAndAllergies": "Takes over-the-counter cough syrup. No known allergies.",
    "relevantFamilyHistory": "Father had lung disease (COPD).",
    "relevantSocialHistory": "Taxi driver, lives with wife and young child. Smokes half a pack/day. Drinks socially.",
    "physicalExamFindings": "Temp 100.8°F (38.2°C). Mild expiratory wheezing bilaterally. Productive cough. Oxygen saturation 94% on room air.",
    "correctDiagnosis": "Acute Bronchitis (viral or bacterial)",
    "managementPlanOutline": "Symptomatic treatment (cough suppressants, bronchodilator if wheezing persists). Consider chest X-ray if no improvement. Advise on smoking cessation. Follow-up in 3-5 days.",
    "redFlags_worseningConditions": "I'm coughing up green phlegm now, and my breathing feels much tighter.",
    "familyInvolvementPreference": "Moderate",
    "patientPersona": "Guarded but cooperative"
  },
  {
    "name": "Fatou Diallo",
    "age": 60,
    "genderIdentity": "Female",
    "pronouns": "she/her",
    "nativeLanguage": "Wolof",
    "englishProficiency": "None",
    "culturalBackground": "Fatou is from Senegal. She places high value on family and community support in health matters. She may be reluctant to discuss personal issues or painful symptoms without strong rapport.",
    "mainComplaint": "J'ai des douleurs au ventre depuis quelques jours. (I have stomach pains for a few days.)",
    "secondaryComplaint": "I haven't been able to eat much, and I feel tired.",
    "hiddenConcern": "Worried it might be a curse or a punishment for something.",
    "illnessPerception_Ideas": "I think it's from eating something bad, or maybe too much stress.",
    "illnessPerception_Concerns": "I'm worried about losing strength and not being able to cook for my grandchildren.",
    "illnessPerception_Expectations": "I want medicine to make the pain go away and to feel well enough to resume my duties.",
    "relevantPastMedicalHistory": "Hypertension. No surgeries.",
    "relevantMedicationsAndAllergies": "Hydrochlorothiazide. No known allergies.",
    "relevantFamilyHistory": "Mother died of stomach cancer.",
    "relevantSocialHistory": "Retired, primary caregiver for grandchildren. Lives in multi-generational home. Non-smoker, no alcohol.",
    "physicalExamFindings": "Mild diffuse abdominal tenderness, particularly in the epigastric region. No rebound or guarding. Normal bowel sounds. Abdomen soft. No masses.",
    "correctDiagnosis": "Gastritis vs. Peptic Ulcer Disease",
    "managementPlanOutline": "H. pylori testing (stool antigen/urea breath test), start PPI (proton pump inhibitor), advise bland diet, follow-up for results.",
    "redFlags_worseningConditions": "The pain is now very sharp and constant, and I feel dizzy.",
    "familyInvolvementPreference": "High",
    "patientPersona": "Polite and traditional"
  },
  {
    "name": "Hiroshi Sato",
    "age": 75,
    "genderIdentity": "Male",
    "pronouns": "he/him",
    "nativeLanguage": "Japanese",
    "englishProficiency": "Conversational",
    "culturalBackground": "Hiroshi is from Japan. He is typically reserved and may minimize symptoms to avoid causing trouble. He values efficiency and clear instructions. He may not ask questions unless explicitly invited.",
    "mainComplaint": "足が腫れていて、とても痛いです。 (My leg is swollen and very painful.)",
    "secondaryComplaint": "It feels warm to the touch.",
    "hiddenConcern": "Worried about deep vein thrombosis (DVT) because his friend recently had one.",
    "illnessPerception_Ideas": "I think it's just from walking too much yesterday, or maybe an insect bite.",
    "illnessPerception_Concerns": "I'm worried about it getting worse and not being able to go fishing.",
    "illnessPerception_Expectations": "I want to know what this swelling is and get treatment quickly.",
    "relevantPastMedicalHistory": "Hyperlipidemia. No history of DVT.",
    "relevantMedicationsAndAllergies": "Atorvastatin. No known allergies.",
    "relevantFamilyHistory": "No significant family history of clotting disorders.",
    "relevantSocialHistory": "Retired, lives with wife. Enjoys fishing. Non-smoker, occasional sake.",
    "physicalExamFindings": "Left lower extremity edema and erythema, warm to touch, very tender to palpation, particularly in the calf. Positive Homan's sign. No palpable cords. Doppler ultrasound pending.",
    "correctDiagnosis": "Deep Vein Thrombosis (DVT)",
    "managementPlanOutline": "Urgent lower extremity Doppler ultrasound. Start anticoagulation (e.g., Lovenox/Eliquis). Admission for monitoring/management. Rule out PE.",
    "redFlags_worseningConditions": "Now I'm having trouble breathing, and my chest hurts when I take a deep breath.",
    "familyInvolvementPreference": "Low",
    "patientPersona": "Polite and stoic"
  },
  {
    "name": "Sofia Petkova",
    "age": 30,
    "genderIdentity": "Female",
    "pronouns": "she/her",
    "nativeLanguage": "Bulgarian",
    "englishProficiency": "Fluent",
    "culturalBackground": "Sofia is from Bulgaria. She is direct in communication and values clear, honest answers. She appreciates a logical and comprehensive approach to medical care.",
    "mainComplaint": "I've been having really bad dizzy spells and heart palpitations, especially when I'm stressed.",
    "secondaryComplaint": "Feeling generally anxious and difficulty falling asleep.",
    "hiddenConcern": "Worried it might be a serious heart condition that runs in her family, or a panic disorder.",
    "illnessPerception_Ideas": "I think it's just anxiety from work, but the heart feelings are new.",
    "illnessPerception_Concerns": "I'm worried I might have a heart attack or something serious, or that I won't be able to manage my stress.",
    "illnessPerception_Expectations": "I want to know if my heart is okay and get something to help with the dizziness and anxiety.",
    "relevantPastMedicalHistory": "Occasional generalized anxiety, self-managed. No cardiac history.",
    "relevantMedicationsAndAllergies": "None. No known allergies.",
    "relevantFamilyHistory": "Mother has anxiety and father had early onset heart disease.",
    "relevantSocialHistory": "Accountant, lives with partner. Non-smoker, non-drinker. High-stress job.",
    "physicalExamFindings": "HR 90 bpm, regular. BP 120/80 mmHg. No murmurs or extra heart sounds. No edema. Appears slightly anxious. Physical exam otherwise unremarkable.",
    "correctDiagnosis": "Panic Disorder with secondary palpitations, exacerbated by stress",
    "managementPlanOutline": "ECG to rule out cardiac issues. Discuss relaxation techniques, CBT referral. Consider SSRI if severe. Advise stress management.",
    "redFlags_worseningConditions": "I feel like I can't breathe and my chest is really tight now.",
    "familyInvolvementPreference": "Low",
    "patientPersona": "Expressive and analytical"
  }
]